export const topServices = [
  "Web-разработка",
  "CMS",
  "Дизайн",
  "Telegram",
  "Чат-боты",
  "NFT",
  "AR/VR",
  "Кибербезопасность",
];

export const services = [
  {
    title: "Веб-разработка и дизайн:",
    child: [
      "Разработка и поддержка веб-сайтов",
      "Дизайн пользовательских интерфейсов (UI) и пользовательских опытов (UX)",
      "Создание логотипов и брендинга",
      "Создание и поддержка веб-сайтов",
      "Разработка интерактивных веб-приложений",
    ],
  },
  {
    title: "Создание ТЕЛЕГРАМ БОТА:",
    child: [
      "Разработка идеи и функционала бота",
      "Интеграция с базами данных",
      "Реализация пользовательских команд",
      "Интерфейс с интуитивно понятным дизайном",
      "Обеспечение безопасности и конфиденциальности данных",
    ],
  },
  {
    title: "Мобильная разработка:",
    child: ["Разработка мобильных приложений для iOS и Android"],
  },
  {
    title: "Создание Криптовалютных Бирж:",
    child: [
      "Разработка платформ для обмена криптовалют, включая функционал торговли, депозиты и снятие средств",
    ],
  },
  {
    title: "Разработка Смарт-Контрактов:",
    child: [
      "Создание умных контрактов для различных блокчейн-платформ, таких как Ethereum, Binance Smart Chain, Solana и другие",
    ],
  },
  {
    title: "Разработка программного обеспечения:",
    child: [
      "Написание программ и скриптов для автоматизации задач",
      "Разработка настольных приложений",
    ],
  },
  {
    title: "Блокчейн-разработка:",
    child: [
      "Создание смарт-контрактов",
      "Разработка децентрализованных приложений (DApps)",
    ],
  },
  {
    title: "Разработка Кошельков:",
    child: [
      "Создание безопасных и удобных криптовалютных кошельков для хранения и управления активами",
    ],
  },
  {
    title: "Разработка NFT-проектов:",
    child: [
      "Создание проектов, связанных с невзаимозаменяемыми токенами (NFT), таких как маркетплейсы, игры и искусство",
    ],
  },

  {
    title: "Игровая разработка:",
    child: [
      "Создание игр и игровых приложений",
      "Разработка графики и анимаций для игр",
    ],
  },
  {
    title: "Машинное обучение и искусственный интеллект:",
    child: [
      "Разработка моделей машинного обучения",
      "Обработка данных и создание алгоритмов",
    ],
  },
  {
    title: "Системная интеграция:",
    child: [
      "Интеграция различных систем и программных продуктов",
      "Разработка API",
    ],
  },
  {
    title: "Кибербезопасность:",
    child: [
      "Проведение аудита безопасности",
      "Разработка средств защиты от взломов",
    ],
  },
  {
    title: "Разработка встроенного программного обеспечения:",
    child: ["Программирование для микроконтроллеров и встраиваемых систем"],
  },
  {
    title: "Тестирование программного обеспечения:",
    child: ["Автоматизация тестирования", "Проведение тестовых сценариев"],
  },
  {
    title: "Программирование и разработка ПО:",
    child: [
      "Разработка мобильных приложений",
      "Написание скриптов и программ",
      "Разработка игр",
    ],
  },
  {
    title: "Разработка электронной коммерции:",
    child: ["Создание интернет-магазинов", "Интеграция платежных систем"],
  },
  {
    title: "Разработка сайтов на CMS:",
    child: [
      "Работа с популярными системами управления контентом, такими как WordPress, Joomla, Drupal",
    ],
  },
  {
    title: "Разработка тем и плагинов:",
    child: [
      "Создание пользовательских тем и расширений для платформ и фреймворков",
    ],
  },
  {
    title: "Оптимизация производительности:",
    child: ["Улучшение скорости и производительности веб-приложений"],
  },
  {
    title: "Разработка чат-ботов:",
    child: [
      "Создание ботов для платформ мессенджеров",
      "Интеграция с API мессенджеров",
    ],
  },
  {
    title: "Разработка микросервисов:",
    child: ["Создание микросервисной архитектуры для веб-приложений"],
  },
  {
    title: "Разработка расширений для браузеров:",
    child: ["Создание дополнений и расширений для популярных браузеров"],
  },
  {
    title: "Разработка сетевых приложений:",
    child: [
      "Создание приложений, использующих сетевые технологии, такие как TCP/IP, WebSocket и др",
    ],
  },
  {
    title: "Разработка инструментов автоматизации:",
    child: [
      "Написание скриптов и инструментов для автоматизации рутины и задач",
    ],
  },
  {
    title: "Разработка под высокую нагрузку:",
    child: [
      "Оптимизация веб-приложений для работы с большими объемами данных и трафика",
    ],
  },
  {
    title: "Геопространственная разработка:",
    child: [
      "Создание географических информационных систем (ГИС) и картографических приложений",
    ],
  },
  {
    title: "Разработка финансовых платформ:",
    child: [
      "Создание финансовых приложений, банковских систем или платформ для онлайн-платежей",
    ],
  },
  {
    title: "Разработка систем управления производственными процессами:",
    child: [
      "Создание программ для автоматизации и оптимизации производственных процессов",
    ],
  },
  {
    title: "Разработка приложений для образования:",
    child: [
      "Создание онлайн-учебных платформ, электронных учебников и приложений для образования",
    ],
  },
  {
    title:
      "Разработка программ для виртуальной реальности (VR) и дополненной реальности (AR):",
    child: ["Создание виртуальных и дополненных сценариев, приложений и игр"],
  },
  {
    title: "Разработка систем управления ресурсами предприятия (ERP):",
    child: [
      "Создание программных решений для управления бизнес-процессами предприятий",
    ],
  },
  {
    title: "Разработка приложений для умных устройств:",
    child: [
      "Создание программ для взаимодействия с умными устройствами и домашней автоматизации",
    ],
  },
  {
    title: "Разработка систем для анализа данных социальных медиа:",
    child: [
      "Создание инструментов для сбора и анализа данных из социальных сетей",
    ],
  },
];
